/*
 *    1. 변수  : 한가지 데이터를 저장하는 공간
 *    ========
 *    	사용)  
 *           식별자(변수 명칭법) => 메소드, 클래스 적용
 *           => 알파벳, 한글로 시작( 단 알파벳 대소문자 구분)
 *           => 숫자 사용 가능(앞에 사용 금지)
 *           => 특수문자 사용 가능(_, $)
 *           => 글자수는 제한X -> 보통 3~7자 사용
 *           *** 헝거리언식 표기법
 *               변수 : fileName, fileSize           
 *           ===================================메모리 주소의 별칭 (저장된 위치 확인)
 *           *** 중복X
 *           => 변수 ==> 현재(지역변수) => 사용범위가 {} 안에서만 사용 가능
 *           						=> {} 끝나면 자동 소멸
 *           => 선언 방식
 *            	데이터크기 변수명=값;
 *              =======
 *                데이터형 (정수, 실수, 논리, 문자, 문자열)
 *                *** 지역변수는 반드시 초기값을 설정해야 함    
 *  
 *    2. 데이터형
 *    3. 연산자
 *    4. 제어문
 *       
 *    ==============================
 *    5. 데이터를 묶어서 사용 => 배열, 클래스
 *    6. 명령문을 묶어서 사용 => 메소드
 *    ==============================
 *    7. 데이터+명령문 => 객체지향프로그램
 *    8. 종료하지 않는 프로그램 제작 => 예외처리
 *    9. 자바에서 제공하는 기능
 *    10. 자바에서 제공하는 기능
 *    11. 조립(사용자 정의 + 라이브러리)
 */
public class 기본문법정리 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
