/*
 *     ¼±ÅÃ Á¶°Ç¹®
 *     if(Á¶°Ç¹®)
 *     {
 *     		Á¶°Ç¹®ÀÌ true¸é ¼öÇàÇÏ´Â ¹®Àå ±¸Çö
 *     }
 *     else
 *     {
 *     		Á¶°Ç¹®ÀÌ false¸é ¼öÇàÇÏ´Â ¹®Àå ±¸Çö
 *     }
 *     
 *     Á¶°Ç¹® ==>  ÇÙ½É (Á¶°Ç Á¦ÀÛ)
 *     
 *     ´ÜÀÏ
 *     	==
 *     	>
 *     	<
 *     	!=
 *     
 *     Á¶°Ç¿©·¯°³ÀÏ °æ¿ì
 *     	&&   
 *     	||
 *     
 *     ch>='A' && ch<='Z'
 *     ch>='0' && ch<='9'
 *     ch>='°¡' && ch<='ÆR'  
 *     =====================> ¹øÈ£°¡ ÀÏ·üÀûÀÏ ¶§
 *     
 *     1,2,5,7,9
 *     ch==1 || ch==2 || ch==5 || ch==7 || ch==9
 *     ==========================================> ¹øÈ£°¡ ÀÏ·üÀûÀÌÁö ¾ÊÀ» ¶§
 *     
 *     ¹®ÀÚ¿­ ==> !=, == À» »ç¿ëÇÏÁö ¾ÊÀ½
 *     equals()
 *     !equals()
 *     
 */
import java.util.*;
public class Á¦¾î¹®_¼±ÅÃÁ¶°Ç¹® {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		// ¹®ÀÚ ÇÑ °³¸¦ ÀÔ·Â¹Þ¾Æ¼­ ¾ËÆÄºªÀÎÁö ¿©ºÎ È®ÀÎ
		//º¯¼ö¼³Á¤
		char ch='A'; // º¯¼ö => ÃÊ±âÈ­
		/*
		 *  int => 0
		 *  double=>0.0
		 *  long => 0L
		 *  boolean => false
		 * 
		 */
		// ¹®ÀÚ ÇÑ°³ ÀÔ·Â
		
		Scanner scan=new Scanner(System.in);
		System.out.print("¹®ÀÚ ÀÔ·Â:");
		//"ABC" ==> ÀÚ¹Ù´Â ¸ðµç ½ÃÀÛ ¹øÈ£ 0ºÎÅÍ
		ch=scan.next().charAt(0);
		
		// ¼ýÀÚ ==> if ( ch>='0' && ch<='9' )
		if((ch>='A'&& ch<='Z')|| (ch>='a'&& ch<='z'))
		{
			System.out.println(ch+"´Â(Àº) ¾ËÆÄºªÀÔ´Ï´Ù!!");
		}
		else
		{
			System.out.println(ch+"´Â(Àº) ¾ËÆÄºªÀÌ ¾Æ´Õ´Ï´Ù!");
		}
		
	
		
		
		
	}
		
	

}
