/*
 *    << , >>
 *    쉬프트연산자 => 비트이동 연산자
 *    << : 왼쪽으로 이동  ==> 공백에 0을 채움
 *    	   => x << y  ==> x*2^y
 *        10 << 2 
 *        1010 => 10
 *      101000 => 40
 *    >> : 오른쪽으로 이동 ==> 비트를 제거
 *    	   => x >> y ==> x/2^y
 *       10 >> 2
 *       1010 => 10
 *         10 => 2
 *       
 *       8<<3
 *       1000 => 8
 *    1000000 => 64
 *    
 *       8>>3
 *       1000 => 8
 *          1 => 1
 *     
 *     	 20 << 3 
 *      	=> 20*2^3 = 160
 *       20 >> 3
 *          => 20/2^3 = 2  
 */
public class 이항연산자_쉬프트연산자 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
